In [36]:
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np
import requests
import time
from pprint import pprint
from urllib.error import HTTPError
import random

In [37]:
post_secondary_csv = pd.read_csv("Postsecondary_School_Location_201718.csv")
post_secondary_complete_df = pd.DataFrame(post_secondary_csv)
post_secondary_df = post_secondary_complete_df[["STATE", "NMCNTY"]]
post_secondary_df= post_secondary_df.rename(columns = {"NMCNTY":"county"})
post_secondary_df.head()

  STATE           county
0    GA   Carroll County
1    GA     Towns County
2    HI  Honolulu County
3    HI    Hawaii County
4    HI  Honolulu County

In [38]:
post_secondary_df["county"]=post_secondary_df.county.str.title()
post_secondary_df.head()

  STATE           county
0    GA   Carroll County
1    GA     Towns County
2    HI  Honolulu County
3    HI    Hawaii County
4    HI  Honolulu County

In [39]:
post_secondary_df=post_secondary_df.replace(regex=['County'], value='')
post_secondary_df=post_secondary_df.replace(regex=['City'], value='')
post_secondary_df=post_secondary_df.replace(regex=['Parish'], value='')
post_secondary_df=post_secondary_df.replace(regex=['Borough'], value='')
post_secondary_df=post_secondary_df.replace(regex=['Municipality'], value='')
post_secondary_df['county'] = post_secondary_df['county'].str.strip()
print(post_secondary_df)

     STATE     county
0       GA    Carroll
1       GA      Towns
2       HI   Honolulu
3       HI     Hawaii
4       HI   Honolulu
...    ...        ...
7594    UT     Uintah
7595    UT      Cache
7596    UT       Utah
7597    UT  Salt Lake
7598    UT  Salt Lake

[7599 rows x 2 columns]

In [40]:
post_secondary_df["county"] = post_secondary_df["county"].map(str) + ", "+ post_secondary_df["STATE"]
post_secondary_df.head()

  STATE        county
0    GA   Carroll, GA
1    GA     Towns, GA
2    HI  Honolulu, HI
3    HI    Hawaii, HI
4    HI  Honolulu, HI

In [41]:
post_secondary_df = post_secondary_df["county"]
print(post_secondary_df)

0         Carroll, GA
1           Towns, GA
2        Honolulu, HI
3          Hawaii, HI
4        Honolulu, HI
            ...
7594       Uintah, UT
7595        Cache, UT
7596         Utah, UT
7597    Salt Lake, UT
7598    Salt Lake, UT
Name: county, Length: 7599, dtype: object

In [42]:
post_sec_counts = post_secondary_df.value_counts()
print(post_sec_counts)

Los Angeles, CA    228
Cook, IL           125
Maricopa, AZ        92
New York, NY        91
Miami-Dade, FL      88
                  ...
Hancock, IN          1
Pennington, MN       1
Abbeville, SC        1
Warren, IL           1
Winnebago, IA        1
Name: county, Length: 1508, dtype: int64

In [43]:
post_sec_df = pd.DataFrame()
post_sec_df["counts"]=post_sec_counts
post_sec_df = post_sec_df.reset_index(drop=False)
post_sec_df = post_sec_df.rename(columns = {"index":"county"})
post_sec_df.head()

            county  counts
0  Los Angeles, CA     228
1         Cook, IL     125
2     Maricopa, AZ      92
3     New York, NY      91
4   Miami-Dade, FL      88

## Testing to see if can analyze now with county data so copied it over here

In [44]:
county_raw = pd.read_excel("county_name.xls", sheet_name = "EDU01A", usecols = "A")

In [45]:
county = county_raw[~county_raw.Area_name.str.contains(",") == False]

In [46]:
county = county.reset_index(drop = True)
county = county.rename(columns={"Area_name": "county"})

In [47]:
random_counties = county.sample(n=1400)
random_counties = random_counties.reset_index(drop=True)
random_counties.head()

           county
0  Montgomery, IN
1      Sussex, VA
2     Liberty, TX
3    Cape May, NJ
4       Osage, KS

In [48]:
random_counties = random_counties.county.astype(str) #may need to do this in the counties doc could get same error for all when go to analyze
post_sec_analysis = pd.DataFrame()
post_sec_analysis["county"]=random_counties
post_sec_analysis.head()

           county
0  Montgomery, IN
1      Sussex, VA
2     Liberty, TX
3    Cape May, NJ
4       Osage, KS

In [49]:
post_sec_analysis = post_sec_analysis.merge(post_sec_df, on="county")
post_sec_analysis.head()

             county  counts
0    Montgomery, IN       1
1           Ada, ID      12
2  Hillsborough, NH      15
3     Pendleton, WV       1
4       Cascade, MT       3

In [50]:
print(len(post_sec_analysis))

631